Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БНС_ОстаткиИСМП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровУслуг/Forms/ФормаДокументаОбщая/Ext/Form/Module.bsl
&НаСервере
Процедура БНС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ БНС_БереговойНС 27.09.2026
	НоваяКоманда = ЭтаФорма.Команды.Добавить("БНС_ЗаполнитьКодыМаркировкиПоОстаткам");
	НоваяКоманда.Заголовок = "(БНС) Заполнить коды маркировки по остаткам";
	НоваяКоманда.Действие = "БНС_ЗаполнитьКодыМаркировкиПоОстаткам";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("БНС_ЗаполнитьКодыМаркировкиПоОстаткам", Тип("КнопкаФормы"), Элементы.ТоварыЗаполнить);
	НовыйЭлемент.Заголовок = "(БНС) Заполнить коды маркировки по остаткам";
	НовыйЭлемент.ИмяКоманды = "БНС_ЗаполнитьКодыМаркировкиПоОстаткам";
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("БНС_ОчиститьКодыМаркировки");
	НоваяКоманда.Заголовок = "(БНС) Очистить коды маркировки";
	НоваяКоманда.Действие = "БНС_ОчиститьКодыМаркировки";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("БНС_ОчиститьКодыМаркировки", Тип("КнопкаФормы"), Элементы.ТоварыЗаполнить);
	НовыйЭлемент.Заголовок = "(БНС) Очистить коды маркировки";
	НовыйЭлемент.ИмяКоманды = "БНС_ОчиститьКодыМаркировки";
    // -- БНС_БереговойНС 27.09.2026
	
КонецПроцедуры

&НаКлиенте
Процедура БНС_ОчиститьКодыМаркировки(Команда)

	// ++ БНС_БереговойНС 27.09.2026
	ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
	Оповещение = Новый ОписаниеОповещения("БНС_ВопросПередОчисткойТабличнойЧастиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

&НаКлиенте
Процедура БНС_ВопросПередОчисткойТабличнойЧастиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		БНС_ОчиститьКодыМаркировкиНаСервере();
		
		ПоказатьОповещениеПользователя("Коды маркировки успешно очищены", ,"Успешно выполнена очистка кодов маркировки", БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Информация);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БНС_ЗаполнитьКодыМаркировкиПоОстаткам(Команда)

	// ++ БНС_БереговойНС 27.09.2026
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;	
	
	ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
	Оповещение = Новый ОписаниеОповещения("БНС_ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

&НаКлиенте
Процедура БНС_ВопросПередЗаполнениемТабличнойЧастиЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		БНС_ЗаполнитьКодыМаркировкиПоОстаткамНаСервере();
		
		ПоказатьОповещениеПользователя("Коды маркировки успешно перезаполнены", ,"Успешно выполнено перезаполнение кодов маркировки", БиблиотекаКартинок.Информация, СтатусОповещенияПользователя.Информация);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура БНС_ОчиститьКодыМаркировкиНаСервере()

	// ++ БНС_БереговойНС 27.09.2026
	//Объект.ШтрихкодыУпаковок.Очистить();
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026

&НаСервере
Процедура БНС_ЗаполнитьКодыМаркировкиПоОстаткамНаСервере()

	// ++ БНС_БереговойНС 27.09.2026
	СтруктураРезультатов = БНС_ОбщегоНазначенияГИСМ.ПолучитьСвободнуюМаркировку(Объект.Ссылка);
	
	ТзнОбщие = СтруктураРезультатов.ТзнОбщий;
	ТзнКоды  = СтруктураРезультатов.ТзнКоды;
	
	Для Каждого СтрПроверка Из ТзнОбщие Цикл
		
		Если СтрПроверка.Остаток >= СтрПроверка.Количество Тогда
			
			Счетчик = СтрПроверка.Количество;
			МассивКодов = ТзнКоды.НайтиСтроки(Новый Структура("Номенклатура", СтрПроверка.Номенклатура));
			Для Каждого СтрКод Из МассивКодов Цикл
				
				Если СтрКод.Остаток > 1 Тогда
					Сообщить("Упаковка, пропускаю код: " + СтрКод.ШтрихкодУпаковки);
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Объект.ШтрихкодыУпаковок.Добавить();	
				НоваяСтрока.ШтрихкодУпаковки = СтрКод.ШтрихкодУпаковки;
				
				Счетчик = Счетчик - СтрКод.Остаток;
				Если Счетчик <= 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ОбщегоНазначения.СообщитьПользователю("Нет маркировки: " + Объект.Ссылка + ", по товару: " + СтрПроверка.Номенклатура);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // -- БНС_БереговойНС 27.09.2026
